Tekla Open API Reference for Tekla Structures 2025
Drawing.PlaceViews Method
 Places views on the sheet. Computes the required size of the views to fit the parts, then places the views so that they fit on the sheet and do not overlap. Adjusts the sheet size if needed.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool PlaceViews()
Public Function PlaceViews As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
Drawing Class
Tekla.Structures.Drawing Namespace